from res.def_res import DefRess


class RuRes(DefRess):
    name = '🇷🇺 Русский 🇷🇺'
    greetings = '💰💰 Это проще чем кажется 💰💰\n' \
                '💰 и гораздо полезнее чем вы можете представить!! 💰'
    cancel = '❌ Отмена ❌'
    deposit_btn = '💳 Пополнить 💳'
    about_btn = '❓ Информация о нас ❓'
    raffle_btn = '🏆 Розыгрыши 🏆'
    promo_btn = '💰 Промо 💰'
    reff_join_btn = '🎫 Участвовать 🎫'
    page = '📖 страница'
    back = '⬅️ назад'
    enter_amount = 'Введите количество Matic которое хотите купить. \n' \
                   'Текущая цена: '
    category = '🎯 Категории 🎯'
    empty_category = '🤷🏽‍♀️ Категория пока пуста..'
    request_wallet1 = 'Зарегистрируйтесь на Metamask, и установить плагин для браузера'
    request_wallet2 = 'В окне плагина создайте свой новый кошелек и скопируйте его адрес, затем пришлите сюда.'
    send_adress = 'Отправить адрес'
    enter_adress = 'Пришлите адрес'
    go_to_promo = 'Для участия в промо передите на наш сайт:'
    go_to_rafle = 'Для участия в розыгрыше передите на наш сайт:'
    my_adress = '🔑 Адрес MATIC 🔑'
    your_adress = '🔑🔑🔑🔑🔑\n\nВаш MATIC адрес: '
    change_adress = '🔑 Сменить адрес MATIC 🔑'
    chose_ticket = 'Выберите количество билетов или введите свое значение'
    for_ticket_deposit = 'За столько билетов вам нужно заплатить '
    you_can_get_matic = 'Вы можете получить MATIC через нашего бота, или перейти к розыгрышу прямо сейчас'
    deposit_for_btn = '💸 Пополнить 💸 '